all_tlds = [
    # ".ai",  # 安圭拉 (Anguilla)，因人工智能 (Artificial Intelligence) 流行
    # ".am",  # 亚美尼亚 (Armenia)，因“AM 广播电台”流行
    # ".be",  # 比利时 (Belgium)，被用作短语“是” (be)
    ".so",
    # ".io",  # 英属印度洋领地 (British Indian Ocean Territory)，被科技初创公司广泛使用
    # ".im",  # 马恩岛 (Isle of Man)，被用作即时消息 (IM) 或个人名称相关
    # ".is",  # 冰岛 (Iceland)，被用作短语“是” (is)
    # ".to",  # 汤加 (Tonga)，被用作短语 “to” 的结尾，或与方向相关
    # ".me",  # 黑山 (Montenegro)，被用作个人品牌和博客
    # ".io",  # 英属印度洋领地 (重复，但非常广泛，用于输入输出)
    # ".ms",  # 蒙特塞拉特 (Montserrat)，被用作“MS”（Microsoft）相关
    # ".cc",
    # ".sh",
    # ".gg",
    # ".tt",

    # ".com",  # 商业用途，全球最流行
    # ".net",  # 网络服务，技术站点常用
    # ".org",  # 非盈利组织、公益项目
    # ".biz",  # 商业和企业用途
    # ".app",  # 应用程序和技术项目
    # ".dev",  # 开发者和技术站点
    # ".xyz",  # 创意域名，技术社区流行
    # ".top",  # 创意域名市场流行
    # ".fun",  # 娱乐类站点
    # ".dog",  # 宠物相关
    # ".run",  # 运动类站点
    # ".ink"   # 创意和设计相关


    # ".cool",  # 创意类站点
    # ".love",  # 情感类站点
    # ".blue",  # 创意和设计相关
    # ".free",   # 免费资源站点，注册量 ~ 300,000
    # ".tech",   # 技术行业，注册量 ~ 800,000
    # ".code",   # 编码和开发者，注册量 ~ 300,000
    # ".info",   # 信息类站点，注册量 ~ 4,200,000
]
